[
  {
    "id": 81,
    "title": "Update to DotVVM 2.5.1",
    "html": "<p>We’ve just released DotVVM 2.5.1 – a new version bringing an important fix. <strong>If you are using DotVVM 2.5, please upgrade to 2.5.1.<\/strong><\/p><p><br><\/p><h3>Summary<\/h3><p>In DotVVM 2.5, if you return a file as a response to postback or a static command (either using <em>Context.ReturnFile <\/em>or <em>Context.Redirect<\/em>), subsequent postbacks on the page are disabled and the user is not able to perform any action on the page.<\/p><p><br><\/p><h3>How to fix the issue<\/h3><p>Upgrade to DotVVM 2.5.1 where the issue is fixed. <\/p><p><br><\/p><h3>Background<\/h3><p>In DotVVM 2.5, we’ve done several improvements to the postback and static command pipeline. One important thing we tried to address was the behavior of redirects. When the page receives a redirect response, the browser starts loading the new page, however the current page is still working for a while. If the server responds slowly, the page can still work for a couple of seconds. The user can click on buttons which trigger another postbacks or static commands (which can be processed faster than loading the new page so they are applied on the current page as well). <\/p><p>It is a natural behavior of web, and all in all, it is not a significant issue. However, it can lead to some confusion – the postbacks made during the redirect may fail because of invalid state of the viewmodel (when you send the user away using a redirect, you don’t commonly expect that the viewmodel will be used again). That’s why we thought it would be a nice thing to disable postbacks once we get the redirect response – we wanted to make sure that the redirect is the last thing that will happen on the page. <\/p><p>In SPA (which basically doesn’t unload the page), we enable the postbacks once the SPA navigation is completed. In normal apps we just disabled the postbacks because the page will be unloaded eventually. <\/p><p>What we didn’t realize is the fact that if you send a file as a response (either by using our own function ReturnFile, or by redirecting on it), the page is not unloaded at all – the browser just starts to download the file but the page remains active. What happens is that once you send the user a file, the page becomes unusable and the user cannot make another postback. Our UI tests unfortunately didn’t cover this scenario, so this issue unfortunately got into the production release.<\/p><p>There is even no browser event that we could hook on to detect that the file download has started. There are some obscure ways how to detect that the file download started (sending a cookie with the file and observing it on the client-side using a timer), but we didn’t want to go that way. That’s why we decided to remove the postback disabling feature. <\/p><p>The feature is still present in SPAs because there is an event that tell us when to enable the postbacks, so when you redirect or navigate to a new page, it is not possible to start a new postback. Also, we have made sure that the long-running postbacks from the previous page are not applied to the new page. <\/p><p><br><\/p><p>We will be porting this fix into DotVVM 3.0 shortly. We have to implement it in a different way as the JavaScript part of the framework was heavily refactored (and luckily, it fixes additional issues we had in the postback pipeline).<\/p>"
  },
  {
    "id": 80,
    "title": "Announcing DotVVM 2.5",
    "html": "<p>We’ve just released a new minor version of <strong>DotVVM <\/strong>– the version <strong>2.5<\/strong>. It took longer than we expected, but there were several fixes and features we wanted to squeeze in this release.<\/p><p><br><\/p><p><strong>DotVVM 2.5 <\/strong>brings several new features which may simplify the <a href=\"https:\/\/www.dotvvm.com\/modernize\">use of DotVVM in older ASP.NET Web Forms projects<\/a>, as well as significant performance and stability improvements. <\/p><p>The main improvements were already present in the <a href=\"https:\/\/www.dotvvm.com\/blog\/76\/Announcing-DotVVM-2-5-Preview-2\">Preview 2<\/a>, but let’s remind them here.<\/p><p><br><\/p><h2>Experimental feature: Explicit assembly loading<\/h2><p>Those of you who tried to install <strong>DotVVM <\/strong>into an old ASP.NET Web Forms project probably run into several issues with incorrect project references. Until now, DotVVM tried to load all referenced assemblies (including transitive ones) and scan them for various things (namespaces in the @import directive, attached property declarations and so on). This was quite inefficient, and caused problems as the mess references often found in legacy projects prevented the application to run.<p>Now, it is possible to turn this feature on, and then explicitly list assemblies that DotVVM should work with:<pre class=\"brush:csharp\"><code class=\"language-CSHARP\">\/\/ enable the feature\nconfig.ExperimentalFeatures.ExplicitAssemblyLoading.Enable();\n\n\/\/ add assemblies\nconfig.Markup.Assemblies.Add(\"assemblyName\");<\/code><\/pre><p><br><\/p><h2>Startup and background view compilation<\/h2><p>Until now, all DotVVM views (pages, master pages and user controls) were compiled on demand - during the first request that needed them. This flow is great for developer inner loop as you typically work with just a few pages you are working on.<\/p><pre class=\"brush:csharp\"><code class=\"language-CSHARP\">\/\/ default behavior\ndotvvm.Markup.ViewCompilation.Mode = ViewCompilationMode.Lazy;<\/code><\/pre><p><br><\/p><p>In production, you can take advantage of two new modes:<ul><li><strong>Deployment slots? Use DuringApplicationStart! <br><\/strong>If you use deployment slots, the new version is launched on a second instance and the infrastructure is waiting until the app is fully initialized. The traffic still goes to the original instance. When the new version responds to a first HTTP request, the infrastructure switches the slots and the traffic will be forwarded to the new version, so there is no downtime. It can be set up quite easily for example in Azure App Service.<br>This mode compiles all the views during the startup routine. <em>It increases the app startup time <\/em>(in larger apps it can take a minute or two) and the app starts responding to the HTTP requests after it has been fully initialized. That’s why it’s a great choice for deployment slots scenario.<br><strong>Do not use this mode without deployments slots <\/strong>unless you don’t care about the downtime – this mode can make the app unavailable for minutes because the view compilation happens during startup.\n<br><br><li><strong>Single-instance deployment? AfterApplicationStart is the choice!<br><\/strong>In this case, the startup time is similar to the <em>Lazy <\/em>mode. The views will be compiled on a background thread immediately after the startup is finished. Thanks to this, there is a high chance that the pages will be already compiled when accessed by the users, at least in less-frequently used apps. <br>If someone visits a page that hasn’t been compiled yet, it will be compiled immediately, same as in the <em>Lazy<\/em> mode.<br>If the application makes additional actions after its startup (e. g. populating caches), you can delay the background compilation using the <em>BackgroundCompilationDelay<\/em> so the CPU is not stressed with too many things at the same time. Also, there is an option to disable parallelism so all CPU cores are not exhausted by doing the view compilation.<\/li><\/ul><p><br><\/p><h2>Redirection helpers in route table<\/h2><p>Sometimes it is useful to be able to register a route which makes a redirect. We’ve seen users writing their own <em>IDotvvmPresenter <\/em>implementations to do this, and so we added an easier way. You can now use <em>AddRouteRedirection<\/em> and <em>AddUrlRedirection<\/em>, which allows you to hook up on a URL you want to redirect, and specify a targer route or URL. There is also an option to process query string and route parameters so the opportunities are endless.<pre class=\"brush:csharp\"><code class=\"language-CSHARP\">\/\/ redirect from \"article\/15\" to \"content\/article\/15\"\nconfig.RouteTable.AddUrlRedirection(\"ArticleRedirection\", \"article\/{id}\", c =&gt; \"content\/article\/\" + c.Parameters[\"id\"]);\n\n\/\/ redirect from \"calendar\" to \"calendar\/{DateTime.Now.Year}\/{DateTime.Now.Month}\"\nconfig.RouteTable.Add(\"Calendar\", \"calendar\/{year}\/{month}\", \"Views\/Calendar.dothtml\");\nconfig.RouteTable.AddRouteRedirection(\"CalendarRedirection\", \"calendar\", \"Calendar\", parametersProvider: (context) =&gt; {\n    var now = DateTime.Now;\n    return new Dictionary&lt;string, object&gt;() \n    {\n        { \"year\", now.Year },\n        { \"month\", now.Month },\n    };\n});<\/code><\/pre><p><br><\/p><p>You can find a complete list of changes and fixes in the <a href=\"https:\/\/github.com\/riganti\/dotvvm\/releases\/tag\/v2.5.0\">Release notes<\/a>.<\/p><p><br><\/p><p>We also continue to improve the DotVVM for Visual Studio extension. Along with many performance &amp; stability improvements, we’ve worked on several new features. Here is one of them: <\/p><h2>“Add DotVVM” feature in DotVVM for Visual Studio<\/h2><p>We’ve also released a new feature of our Visual Studio extension – it’s called <strong>Add DotVVM<\/strong>,<strong> <\/strong>and it dramatically simplifies the process required to <strong>start using DotVVM in an ASP.NET Web Forms, MVC or other app<\/strong>. <\/p><p>Instead of having to <em>install several NuGet packages, update the csproj file, create the Startup.cs and DotvvmStartup.cs files<\/em>, the process now requires just one button click. <\/p><p><a href=\"https:\/\/dotvvmstorage.blob.core.windows.net\/blogpost\/4e7b3448-b463-4691-bb93-e1ded7fdddcb.png\"><img width=\"587\" height=\"355\" title=\"Add DotVVM feature\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"Add DotVVM feature\" src=\"https:\/\/dotvvmstorage.blob.core.windows.net\/blogpost\/b73e71c3-157b-4ee5-b068-10258ca5e908.png\" border=\"0\"><\/a><\/p><p><br><\/p><h2>DotVVM 3.0 is ahead<\/h2><p>The team will now fully focus on delivery of <strong>DotVVM 3.0<\/strong>. There is one big feature we are really looking forward – the ability to write a client-side logic in TypeScript and be able to call it from DotVVM and vice-versa.<\/p><p>Imagine you want to display a Google Map on a page that is powered by DotVVM, and display a pin on the map based on some values in the viewmodel.<\/p><p>Until now, you’d have to create a script file, register it so it’s loaded after DotVVM, and then hook up to <strong>dotvvm.events.init<\/strong> and use something like <strong>dotvvm.viewModels.root.viewModel.CurrentLocation().Latitude()<\/strong>. And if you’d need to make a postback based on something that happened in the map, the only way was to use a hidden button and click on it using JavaScript. There was even not a way to determine whether the postback was successful or if there was some error.<\/p><p>We want to simplify this experience to something much easier.<\/p><p>In the page, you’ll be able to import a “JS module” (this is not a final name of the feature, but that’s how we call it right now): <\/p><pre class=\"brush:dothtml\"><code class=\"language-DOTHTML\">@jsModule Scripts\/map<\/code><\/pre><p>Then, you can add a <strong>map.js <\/strong>file in the <strong>wwwroot\/Scripts <\/strong>folder. Of course, you can use TypeScript that will create the JS file for you. The file should be a JS module that can export several things:<\/p><p>* <strong>init <\/strong>function that will be called after DotVVM is initialized<\/p><p>* <strong>commands<\/strong> – a JS object with functions that can be called from DotVVM controls using a static command:<\/p><pre class=\"brush:dothtml\"><code class=\"language-DOTHTML\">&lt;dot:Button Click=\"{staticCommand: _js.Invoke(\"AddPin\", Latitude, Longitude)}\" \/&gt;<\/code><\/pre><p>There will be other things the module can export – custom postback handlers, handlers for DotVVM events and more! <\/p><p>Also, we plan to introduce a nice API that you can use to invoke postbacks and static commands in the page and update the viewmodel safely (we don’t want you to deal with Knockout observables as there are so many things that could be broken easily).<\/p><p><br><\/p><h2>Join us on a virtual event on November 16 to learn more about DotVVM 3.0<\/h2><p>The DotVVM team hosts an online event on <strong>November 16 at 2:00 PM UTC (3:00 PM CET)<\/strong> as part of .NET Conf local events.<br><a href=\"https:\/\/www.meetup.com\/dotvvm\/events\/273801727\/ical\/DotVVM+%25E2%2599%25A5+.NET+Conf+2020.ics\">Add to calendar<\/a><p>We’ll talk about new features we've added to DotVVM, and we'll share our future plans:<ul><li>Support of .NET 5\n<li>How easy it is to \"Add DotVVM\" into your legacy ASP.NET apps<li>What's new in DotVVM 2.5<li>Roadmap for DotVVM 3.0 - JS modules &amp; client-side extensibility, validation improvements, web components and more!<\/li><\/ul><p><a href=\"https:\/\/www.meetup.com\/dotvvm\/events\/273801727\/\">Register to the online event<\/a><p><br><p>Your feedback is important to us. We’ll be happy to talk on our <a href=\"https:\/\/gitter.im\/riganti\/dotvvm\">Gitter chat<\/a>."
  },
  {
    "id": 79,
    "title": "DotVVM and .NET Conf 2020",
    "html": "<p>.NET Conf is a free, three-day, virtual developer event co-organized by the .NET community and Microsoft. This year .NET 5.0 will launch at .NET Conf 2020! Come celebrate and learn about the new release. We're also celebrating our 10th anniversary and we're working on a few more surprises. You won't want to miss this one.<p><a href=\"https:\/\/www.dotnetconf.net\"><img width=\"550\" height=\"182\" title=\".NET Conf\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\".NET Conf\" src=\"https:\/\/dotvvmstorage.blob.core.windows.net\/blogpost\/b46eb4c9-df85-4f41-b0c5-3428928d49a3.png\" border=\"0\"><\/a><p>Starting <strong>November 10 to November 12<\/strong>, be ready to enjoy influential <a href=\"https:\/\/www.dotnetconf.net\/speakers\">speakers from the community<\/a>.<p>This year the .NET Foundation is supporting community-run virtual events to help spread the word about the .NET 5.0 release. <h2>Join us at DotVVM Virtual Event on November 16<\/h2><p>The DotVVM team hosts an online event on <strong>November 16 at 2:00 PM UTC (3:00 PM CET)<\/strong>. <br><a href=\"https:\/\/www.meetup.com\/dotvvm\/events\/273801727\/ical\/DotVVM+%25E2%2599%25A5+.NET+Conf+2020.ics\">Add to calendar<\/a><p>You'll see new features we've added to DotVVM, and we'll share our future plans:<ul><li>Support of .NET 5<li>How easy it is to \"Add DotVVM\" into your legacy ASP.NET apps<li>What's new in DotVVM 2.5<li>Roadmap for DotVVM 3.0 - JS modules &amp; client-side extensibility, validation improvements, web components and more!<\/li><\/ul><p><a href=\"https:\/\/www.meetup.com\/dotvvm\/events\/273801727\/\">Register to the online event<\/a><p><br><p>You can find more information about .NET Conf 2020 here: <a href=\"http:\/\/www.dotnetconf.net\/\">www.dotnetconf.net<\/a>"
  },
  {
    "id": 78,
    "title": "DOTVVM meetup October chapter on 24th, 2020",
    "html": "<p><iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/8Bd15gGSgdM\" frameborder=\"0\" allowfullscreen=\"\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\"><\/iframe><p><br><p>The DotVVM meetup sessions are back by popular demand. This is an ideal platform for the DotVVM community, which is so diverse and operates across the globe. These meetings will serve as the ideal platform to connect with DotVVM author and experts in the .NET space. Join us on Oct 24 and meet the key players, explore the coolest technology and projects, get up to date with rising trends and applications, and discover what wonders tomorrow’s developers are working on. This will be the fourth of many meetups, and DotVVM is excited to bring the DotVVM community together to share their experiences and create new ones with people who all feel aligned to who they are and are paving their way on their own unique path. Meeting the right people is crucial, and the DotVVM meetup will ensure that you are in the right place at the right time.<p><strong>About Speakers<\/strong><p>Tomáš Herceg is Founder and CEO of RIGANTI, RIGANTI is based out of the Czech Republic and is focused on custom software development, consulting, and solution architecture services. Tomáš is the creator of DotVVM, an open-source framework that simplifies creating a line of business web applications and makes it easier for any .NET developer. Tomáš was awarded Microsoft Most Valuable Professional and Microsoft Regional Director for his influence in technical communities, public speaking, and publishing technical articles.<p>Michal Tichý works at RIGANTI and participates on DotVVM framework, Bootstrap for DotVVM and DotVVM Business Pack. <p><strong>Who should join:<\/strong><p>Are you a developer or looking to join the developer community? Are you looking for like-minded, driven web developers to network and learn together? If you like DotVVM or just simply hanging out with interesting people, this is the platform for you. Everyone is welcome to attend.<p>Please note this meetup is community-driven and Free of cost.<p><strong>Time and Date: <\/strong>4:00 PM UTC, October 24, Saturday.<p><strong>Agenda:<\/strong><p>Welcome note<ul><li>Talk by Tomáš<\/li><li>Talk by Michal<\/li><li>Q&amp;A session<\/li><li>Open Mic session<\/li><\/ul><p><a href=\"https:\/\/forms.office.com\/Pages\/ResponsePage.aspx?id=FVwkmEjDp0WL4SWvzHg5Mae4FIr7MXlErYW-IaUDqetUOElMUVFSUlROMjUzSE5NRFlNVUJCNDRITi4u\">RSVP now!<\/a>"
  },
  {
    "id": 77,
    "title": "Meetup Saga continues and it is on September 19th, 2020",
    "html": "<p><a href=\"https:\/\/dotvvmstorage.blob.core.windows.net\/blogpost\/12013a9a-f103-43e5-963f-bacccd4071e9.png\"><img width=\"640\" height=\"341\" title=\"Virtual meetup\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"Virtual meetup\" src=\"https:\/\/dotvvmstorage.blob.core.windows.net\/blogpost\/8f0ed5df-cf0b-480e-bf69-e7c084166489.png\" border=\"0\"><\/a><\/p><p>If you have been following us, you probably know that Tomáš, the founder of DotVVM, was invited to present at C# Corner’s Ask me anything session. <a href=\"https:\/\/www.youtube.com\/watch?v=Z7qUDFDkYXU&amp;feature=youtu.be\">Here is the recording in case if you have missed the talk<\/a>. <p><strong>The next opportunity to connect with the DotVVM team and Developer Advocates is on our next virtual meetup which will be happening on 19th September 16:00 UTC.<\/strong><p><strong>About Speaker<\/strong><p><strong>Vincent Nwonah<\/strong><p>Vincent is a Senior Software Developer working from Africa’s Technology Hub — Lagos, Nigeria. His areas of expertise include Xamarin, ASP.NET Core, and DotVVM.<p>Vincent recently got the MVP award, and he is also Developer Advocate for DotVVM where is presents developers how to leverage all the awesome functionalities DotVVM offers out of the box to build large and small applications faster, more securely and cheaper.<p>Vincent is currently building distributed applications using microservices in C#, Go, and Typescript so feel free to reach out to him for conversations.<p><strong>Who should join:<\/strong><p>Are you a developer or looking to join the developer community? Are you looking for like-minded, driven web developers to network and learn together? If you like DotVVM or just simply hanging out with interesting people, this is the platform for you. Everyone is welcome to attend.<p>Please note this meetup is community-driven and free of cost.<p><strong>Time and Date: 16:00 UTC, September 19, Saturday.<\/strong><p>Virtual Location: <a href=\"https:\/\/teams.microsoft.com\/l\/meetup-join\/19%3a8c0dcc6be7df459188c7209b9d5b39d2%40thread.tacv2\/1599729454288?context=%7b%22Tid%22%3a%2298245c15-c348-45a7-8be1-25afcc783931%22%2c%22Oid%22%3a%22803cba87-264b-4e27-b74e-ec2ad96da4d4%22%7d\">Join Microsoft Teams Meeting<\/a><p><div class=\"wlWriterSmartContent\" style=\"margin: 0px; padding: 0px; float: none; display: inline;\"><\/div><div class=\"wlWriterEditableSmartContent\" id=\"scid:6E335E69-603A-4F1E-AA4B-726D584133B4:a2ca15c3-a10e-4cba-bdcb-4e1baeb71c18\" style=\"margin: 0px; padding: 0px; float: none; display: inline;\"><a href=\"https:\/\/dotvvmstorage.blob.core.windows.net\/blogpost\/0fac50d0-df7a-452e-acc7-72a613b6b20c.ics\">Add to calendar: DotVVM Community Meetup<\/a><\/div><p><strong>Agenda:<\/strong><p>Welcome note<p>Talk by Vincent<p>Q&amp;A session<p>Open Mic session<p><a href=\"https:\/\/forms.office.com\/Pages\/ResponsePage.aspx?id=FVwkmEjDp0WL4SWvzHg5Mae4FIr7MXlErYW-IaUDqetUOElMUVFSUlROMjUzSE5NRFlNVUJCNDRITi4u\">RSVP now!<\/a>"
  },
  {
    "id": 76,
    "title": "Announcing DotVVM 2.5 Preview 2",
    "html": "<p>Today we have released a public preview of <strong>DotVVM 2.5<\/strong>. Originally, we intended to release it much earlier, but we got a couple of feature requests and bug reports that we wanted to include in 2.5.<\/p><p>The release brings several new features and many stability improvements.<\/p><p><br><\/p><h3>Experimental feature: Explicit assembly loading<\/h3><p>Those of you who tried to install <strong>DotVVM <\/strong>into an old ASP.NET Web Forms project probably run into several issues with incorrect project references. Until now, DotVVM tried to load all referenced assemblies (including transitive ones) and scan them for various things (namespaces in the @import directive, attached property declarations and so on). This was quite inefficient, and caused problems as the mess references often found in legacy projects prevented the application to run.<\/p><p>Now, it is possible to turn this feature on, and then explicitly list assemblies that DotVVM should work with:<\/p><pre class=\"brush:csharp\"><code class=\"language-CSHARP\">\/\/ enable the feature\nconfig.ExperimentalFeatures.ExplicitAssemblyLoading.Enable();\n\n\/\/ add assemblies\nconfig.Markup.Assemblies.Add(\"assemblyName\");\n<\/code><\/pre><p><br><\/p><h3>Redirection helpers in route table<\/h3><p>Sometimes it is useful to be able to register a route which makes a redirect. We’ve seen users writing their own <em>IDotvvmPresenter <\/em>implementations to do this, and so we added an easier way. You can now use <em>AddRouteRedirection<\/em> and <em>AddUrlRedirection<\/em>, which allows you to hook up on a URL you want to redirect, and specify a targer route or URL. There is also an option to process query string and route parameters so the opportunities are endless.<\/p><pre class=\"brush:csharp\"><code class=\"language-CSHARP\">\/\/ redirect from \"article\/15\" to \"content\/article\/15\"\nconfig.RouteTable.AddUrlRedirection(\"ArticleRedirection\", \"article\/{id}\", c =&gt; \"content\/article\/\" + c.Parameters[\"id\"]);\n\n\/\/ redirect from \"calendar\" to \"calendar\/{DateTime.Now.Year}\/{DateTime.Now.Month}\"\nconfig.RouteTable.Add(\"Calendar\", \"calendar\/{year}\/{month}\", \"Views\/Calendar.dothtml\");\nconfig.RouteTable.AddRouteRedirection(\"CalendarRedirection\", \"calendar\", \"Calendar\", parametersProvider: (context) =&gt; {\n    var now = DateTime.Now;\n    return new Dictionary&lt;string, object&gt;() \n    {\n        { \"year\", now.Year },\n        { \"month\", now.Month },\n    };\n});<\/code><\/pre><p><br><\/p><h3>Startup and background view compilation<\/h3><p>Until now, all DotVVM views (pages, master pages and user controls) were compiled on demand - during the first request that needed them. This flow is great for developer inner loop as you typically work with just a few pages you are working on.<\/p><pre class=\"brush:csharp\"><code class=\"language-CSHARP\">\/\/ default behavior\ndotvvm.Markup.ViewCompilation.Mode = ViewCompilationMode.Lazy;<\/code><\/pre><p><br><\/p><p>We have added two new modes for production scenarios:<\/p><ul><li><strong>DuringApplicationStart<\/strong> is great <em>when your application is deployed through deployment slots<\/em> – you deploy the new version to a second instance and wait until it is fully initialized while the traffic still goes to the original instance. When the new version responds to the health-check request, it is switched with the old instance, so there is no downtime. It can be set up quite easily for example in Azure App Service.<br>This mode compiles all the views during the startup routine. It increases the app startup time (in larger apps it can take a minute or two) and the app starts responding to the HTTP requests after it has been fully initialized. That’s why it’s a great for deployment slots scenario. <br>Do not use this mode without deployments slots unless you don’t care about the downtime – this mode can make the app unavailable for minutes because the view compilation happens during startup.<\/li><li><strong>AfterApplicationStart <\/strong>is useful <em>when you don’t have deployment slots<\/em>. The startup time is similar to the previous versions, and the views will be compiled on a background thread immediately after the startup is finished. If someone accesses a page that hasn’t been compiled yet, it will be compiled immediately, similarly to the <em>Lazy<\/em> mode. <br>If the application makes additional actions after its startup (e. g. populating caches), you can delay the background compilation using the <em>BackgroundCompilationDelay<\/em> so the CPU is not stressed with too many things at the same time.<\/li><\/ul><p><br><\/p><p>There are more features and improvements in this release – see <a href=\"https:\/\/github.com\/riganti\/dotvvm\/releases\/tag\/v2.5.0-preview02\"><strong>Release notes<\/strong><\/a> for all the details.<\/p><p>The final version of <strong>DotVVM 2.5<\/strong> is scheduled to the beginning of September. We are still testing DotVVM 2.5 on our own internal projects to be sure that the release is stable enough.<\/p><p>We’ll be glad to hear feedback or help you with any issues with the release. Get in touch on our <a href=\"https:\/\/gitter.im\/riganti\/dotvvm\"><strong>Gitter chat<\/strong><\/a>.<\/p>"
  },
  {
    "id": 75,
    "title": "Its time for our Second Community meetup!",
    "html": "<p><a href=\"https:\/\/dotvvmstorage.blob.core.windows.net\/blogpost\/b51d72ef-0835-4612-a4c3-0ef1f7c49c18.jpg\"><img width=\"228\" height=\"240\" title=\"Virtual meetup02\" style=\"border: 0px currentcolor; border-image: none; margin-right: auto; margin-left: auto; float: none; display: block; background-image: none;\" alt=\"Virtual meetup02\" src=\"https:\/\/dotvvmstorage.blob.core.windows.net\/blogpost\/2cfda730-837d-4ba2-9d86-a3a4f48407cf.jpg\" border=\"0\"><\/a><p>It’s been a busy month at DOTVVM with the start of community meetup, Due to overwhelming responses and demand, we set for our second meetup.<p>Here’s a little recap of what went down last global community meetup!<p>DOTVVMs first global meetup was held in June virtually. Our event schedule was packed with both informative and hands-on activities. The DOTVVM author Tomas presented on Introduction to DOTVVM and web modernization and after that team leaders presented on MVP and getting started with DOTVVM. The event was an opportunity for community building, as well as for the attendees to engage in in-depth Q&amp;A sessions with our team members in real-time.<p>Now for this second meetup, we are aiming to be interactive and allow DOTVVM enthusiasts to learn from other professionals, have questions answered in real-time, discover new projects, and see demos that inspire. This meetup is a place for developer enthusiasts who wouldn’t normally cross paths to meet, collaborate, and learn about what their peers are doing across globally.<p>Attendees will get a chance for an exclusive giveaway of DOTVVM premium licenses at the virtual meetup to give back to our community.<p>Time and Date: 16:00 UTC, August 8, Saturday.<p>Virtual Location: TBA<p><strong>Tentative agenda:<\/strong><p># Opening remarks<p># Hands-on a session by Daniel Gomez Jaramillo<p># Open mic session for you!<p>(Get in touch if you would like to present)<p><a href=\"https:\/\/forms.office.com\/Pages\/ResponsePage.aspx?id=FVwkmEjDp0WL4SWvzHg5Mae4FIr7MXlErYW-IaUDqetUOElMUVFSUlROMjUzSE5NRFlNVUJCNDRITi4u\">RSVP now!<\/a><h3>Daniel Gomez Jaramillo<\/h3><p>Daniel Gomez, Systems Engineering student in Cuenca (Ecuador), Gold Student Partner at Microsoft and Community Leader at Microsoft User Group Ecuador.<p>Daniel is keen on generating online and in-person learning spaces through tutorial articles, conferences, and workshops for students, professionals and Daniel is passionate about technology that can acquire new knowledge and can apply for a better future.<p>Daniel has been active and making contributions in the following areas: cloud computing with Azure, web development with .NET, database design and management, artificial intelligence, and software project management.<p>Links:<a href=\"https:\/\/dev.to\/esdanielgomez\"> https:\/\/dev.to\/esdanielgomez<\/a><p><a href=\"https:\/\/medium.com\/@esdanielgomez\">https:\/\/medium.com\/@esdanielgomez<\/a><p><a href=\"https:\/\/twitter.com\/esdanielgomez\">https:\/\/twitter.com\/esdanielgomez<\/a>"
  },
  {
    "id": 74,
    "title": "Announcing DOTVVM Community Meetup",
    "html": "<p><a href=\"https:\/\/dotvvmstorage.blob.core.windows.net\/blogpost\/eedb6ad0-6c38-41c4-8466-f1073d90009b.jpg\"><img width=\"640\" height=\"341\" title=\"Virtual meetup\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"Virtual meetup\" src=\"https:\/\/dotvvmstorage.blob.core.windows.net\/blogpost\/b29dfb78-3900-438c-9dd6-772f2576daef.jpg\" border=\"0\"><\/a><p>This past couple of months, with lockdown protocols rolling out the world over, our lives and work have turned upside down. How are you coping with the changes? What do you foresee happening six months down the line? With many of us still working remotely, we want to continue to keep you connected with the DotVVM community. So, we are excited to announce the DotVVM Community meetup which will be happening virtually.<p>DotVVM Community online events are hosted by DotVVM Ambassadors and supported by the DotVVM team. Our focus is to serve you and your needs. Share topics\/issues that you’d want us to put together virtual events for. With online events, the constraints of geography no longer exist.<p>Join DotVVM author Tomáš as he introduces DotVVM, Webforms, and web modernization. It’s also a great opportunity for you to get all of your questions answered by Tomáš. With this, we look forward to engaging with you on a more regular basis.<p>We are also keen on anchoring our community via our social media channels. Please tune in to our feeds, and let us know what you think of DotVVM. Hope to see you there, but if you can’t make it, register anyway and we’ll send you the recording.<h2>About Speaker<\/h2><p>Tomáš Herceg is Founder and CEO of RIGANTI, RIGANTI is based out of the Czech Republic and is focused on custom software development, consulting, and solution architecture services. Tomáš is the creator of DotVVM, an open-source framework that simplifies creating a line of business web applications and makes it easier for any .NET developer. Tomáš was awarded Microsoft Most Valuable Professional and Microsoft Regional Director for his influence in technical communities, public speaking, and publishing technical articles.<h3><strong>Who should join:<\/strong><\/h3><p>Are you a developer or looking to join the developer community? Are you looking for like-minded, driven web developers to network and learn together? If you like DotVVM or just simply hanging out with interesting people, this is the platform for you. Everyone is welcome to attend.<p>Please note this meetup is community driven and<strong> Free of cost.<\/strong><p><strong>Time and Date: <\/strong>16:00 UTC, July 4, Saturday.<p><strong>Virtual Location: TBA<\/strong><h2><strong>Agenda:<\/strong><\/h2><p>Welcome note<p>Talk by Tomáš<p>Q&amp;A session<p>Open Mic session<p><a href=\"http:\/\/cutt.ly\/DotVVM-Community-Meetup\">RSVP now<\/a>"
  },
  {
    "id": 73,
    "title": "Free workshop: Modernize your Web Forms app using DotVVM",
    "html": "<p><strong>DotVVM offers a unique upgrade path to .NET Core for ASP.NET Web Forms developers. <\/strong>It allows you to integrate DotVVM framework into a Web Forms app, take ASPX pages one by one and convert them into DotHTML syntax, without the need to rewrite the business layer or build an API that would expose the data for the client-side code. <\/p><p>During the process, the application still works and can be deployed at any time. After getting rid of all Web Forms dependencies, it is possible to move the project to .NET Core.<\/p><p><br><\/p><p>The workshop was hosted on <strong>11th June 2020 <\/strong>on Microsoft Teams. <\/p><p>We plan to repeat the workshop in the future – follow us on our <a href=\"https:\/\/twitter.com\/dotvvm\">Twitter<\/a> or <a href=\"https:\/\/www.facebook.com\/dotvvm\">Facebook<\/a> and stay informed about our further events.<br><br><\/p><p><iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/P_tcgqj88bY\" frameborder=\"0\" allowfullscreen=\"\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\"><\/iframe><\/p>"
  },
  {
    "id": 72,
    "title": "Videos from DotVVM Virtual Conference",
    "html": "<p>The sessions from our first virtual conference are published on our <a href=\"https:\/\/www.youtube.com\/playlist?list=PLq1wAETqUjIZSx6VKcTBXjmnWSYwzU6Sk\"><strong>DotVVM YouTube channel<\/strong><\/a>.<\/p> <p>Learn how to <strong>build ASP.NET Core web sites with the MVVM approach<\/strong>, see how to <strong>modernize old Web Forms applications <\/strong>using DotVVM, and much more. <p><iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/-Dk0gOQxKaU\" frameborder=\"0\" allowfullscreen=\"\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\"><\/iframe> <p>&nbsp; <p><iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/2iolJ_tgP4g\" frameborder=\"0\" allowfullscreen=\"\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\"><\/iframe> <p>&nbsp; <p><iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/e9uvfxWc3So\" frameborder=\"0\" allowfullscreen=\"\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\"><\/iframe> <p>&nbsp; <p><iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/b8DIGJksZ4Y\" frameborder=\"0\" allowfullscreen=\"\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\"><\/iframe> <p>&nbsp; <p><iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/ZnzPMqh04W0\" frameborder=\"0\" allowfullscreen=\"\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\"><\/iframe> <p>&nbsp; <p><iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/w1MuGQ-xDMM\" frameborder=\"0\" allowfullscreen=\"\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\"><\/iframe>"
  }
]
